[net]
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0001
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.0001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1
[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,7,8,9,10,11,12,13,16,22,23,24,26,28,30
[convolutional]
batch_normalize=1
filters=47
size=3
stride=2
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,6,7,8,10,11,13,14,15,16,17,18,19,21,22,25,27,28,31,32,33,34,35,36,38,39,40,41,42,43,44,47,48,49,54,55,56,57,58,60,61,62,63
[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,5,7,13,14,16,17,18,19,21,25,26,27,28,29,30
[convolutional]
batch_normalize=1
filters=47
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,6,7,8,10,11,13,14,15,16,17,18,19,21,22,25,27,28,31,32,33,34,35,36,38,39,40,41,42,43,44,47,48,49,54,55,56,57,58,60,61,62,63
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=100
size=3
stride=2
pad=1
activation=leaky
non_zero_index=1,2,3,4,5,6,7,9,10,11,12,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,37,39,40,43,45,46,48,49,50,51,53,54,55,56,57,58,59,61,62,63,64,66,67,68,69,70,71,72,73,74,76,77,80,81,82,83,84,85,86,87,89,91,92,93,96,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,115,117,120,122,123,126,127
[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,5,7,10,11,12,13,14,16,18,19,20,21,22,28,31,32,33,36,39,41,42,45,47,48,49,51,53,56,57,59,61
[convolutional]
batch_normalize=1
filters=100
size=3
stride=1
pad=1
activation=leaky
non_zero_index=1,2,3,4,5,6,7,9,10,11,12,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,37,39,40,43,45,46,48,49,50,51,53,54,55,56,57,58,59,61,62,63,64,66,67,68,69,70,71,72,73,74,76,77,80,81,82,83,84,85,86,87,89,91,92,93,96,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,115,117,120,122,123,126,127
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,10,13,15,16,17,19,20,21,23,29,30,33,34,35,36,37,38,39,45,47,48,50,53,54,57,58,59,61,62
[convolutional]
batch_normalize=1
filters=100
size=3
stride=1
pad=1
activation=leaky
non_zero_index=1,2,3,4,5,6,7,9,10,11,12,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,37,39,40,43,45,46,48,49,50,51,53,54,55,56,57,58,59,61,62,63,64,66,67,68,69,70,71,72,73,74,76,77,80,81,82,83,84,85,86,87,89,91,92,93,96,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,115,117,120,122,123,126,127
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=251
size=3
stride=2
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[convolutional]
batch_normalize=1
filters=45
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,11,15,16,18,19,22,23,27,29,35,36,38,45,46,48,52,53,54,55,57,58,64,68,71,77,79,81,82,94,97,98,100,102,103,104,109,111,113,116,117,121,122,125,126
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=58
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,2,5,6,7,8,13,16,19,20,21,22,23,24,30,34,42,43,48,49,52,53,58,62,63,64,65,66,69,70,72,73,74,75,76,82,83,85,87,89,91,92,93,94,95,97,98,99,103,105,107,112,113,117,119,121,122,127
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,5,7,8,11,14,15,16,17,25,26,27,28,29,30,32,34,35,38,44,45,50,54,55,57,58,60,61,62,66,67,68,70,71,72,73,75,78,80,82,83,84,87,89,91,93,95,96,99,100,104,107,108,110,113,114,117,118,121,126,127
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,3,8,9,10,11,12,13,18,21,26,28,29,30,35,37,38,40,44,45,47,48,49,52,54,57,59,60,61,62,63,64,65,67,71,72,73,75,77,79,82,85,86,87,88,89,90,94,95,96,97,98,100,104,105,107,108,112,114,115,117,123,124,125
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,2,3,5,6,7,12,13,15,19,22,23,24,25,28,29,30,33,34,35,37,40,41,42,48,49,51,53,58,61,62,63,64,67,68,73,75,76,77,79,81,82,84,85,86,87,90,91,93,97,99,101,103,104,105,107,114,115,117,118,119,123,124,127
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,4,5,7,8,9,15,21,26,27,32,33,35,36,37,38,40,41,43,45,46,47,48,49,51,52,54,56,57,58,59,60,67,71,72,74,78,79,80,81,85,90,91,92,93,96,98,103,105,106,109,110,111,113,115,116,117,118,120,125,126,127
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,2,3,7,8,9,12,16,18,20,21,22,23,25,26,27,29,30,31,36,37,38,39,41,43,44,49,51,52,53,54,56,57,62,66,67,70,74,76,79,84,91,94,95,96,99,101,103,104,106,107,108,109,111,112,113,116,117,118,119,122,123,124,126
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky
non_zero_index=3,5,6,7,14,16,19,22,24,27,28,29,32,33,34,35,37,39,41,42,43,45,46,47,52,55,59,60,61,62,69,70,72,73,76,77,78,81,82,83,85,87,88,91,95,96,97,98,100,103,104,105,106,108,109,115,116,117,119,122,123,124,125,127
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,93,94,95,96,97,98,99,100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=358
size=3
stride=2
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[convolutional]
batch_normalize=1
filters=35
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,4,5,7,15,18,19,30,39,41,59,75,78,81,88,103,110,121,125,128,129,130,135,139,144,163,177,189,191,205,206,208,221,223,255
[convolutional]
batch_normalize=1
filters=358
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=66
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,4,19,41,46,48,49,54,57,62,65,68,72,76,77,78,81,82,83,86,87,91,95,99,104,107,109,124,132,134,138,139,145,146,149,150,151,153,160,161,162,166,168,174,179,180,182,189,192,194,207,212,218,221,222,225,226,227,228,233,234,236,239,240,242,247
[convolutional]
batch_normalize=1
filters=358
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=79
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,8,9,21,25,26,27,33,39,43,44,46,48,49,51,53,61,62,65,68,73,76,80,82,84,88,95,97,99,107,110,111,113,118,120,122,129,131,132,134,136,139,141,146,149,151,153,156,164,166,167,172,175,179,180,182,183,191,192,193,195,197,203,204,212,214,216,217,218,223,224,230,235,238,243,245,247,249,250
[convolutional]
batch_normalize=1
filters=358
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,7,8,9,10,15,16,35,36,39,41,43,46,49,52,56,69,70,71,73,75,78,79,80,82,89,94,100,102,106,107,108,112,116,117,120,124,125,126,129,135,162,165,166,172,173,177,178,179,182,187,190,191,192,194,203,204,206,209,210,212,213,215,222,225,226,232,233,235,248,251
[convolutional]
batch_normalize=1
filters=358
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=95
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,6,7,8,12,14,16,17,18,19,22,30,33,35,38,40,42,45,51,52,53,59,62,64,67,70,71,73,74,78,84,85,88,98,99,103,104,105,106,107,110,111,112,113,121,123,124,125,128,133,136,137,139,141,142,143,147,148,150,158,160,161,164,165,167,168,170,171,172,178,179,181,186,193,199,200,201,204,206,211,215,222,223,225,229,234,237,241,243,245,250,251,255
[convolutional]
batch_normalize=1
filters=358
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=81
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,3,5,6,7,14,15,16,20,31,34,36,41,44,45,48,49,50,57,62,64,67,69,71,72,75,79,82,83,86,89,93,96,97,99,100,110,111,114,123,124,129,131,135,136,139,140,143,145,146,147,152,154,157,160,168,171,172,174,178,182,183,186,189,191,194,196,200,204,205,215,217,220,227,231,232,240,245,249,252,254
[convolutional]
batch_normalize=1
filters=358
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=1
activation=leaky
non_zero_index=7,8,9,16,17,22,29,42,43,50,58,60,65,66,75,78,82,86,89,93,98,99,100,103,107,110,117,118,129,130,133,134,135,136,146,148,149,153,162,165,166,167,170,172,174,177,181,187,191,196,197,200,203,211,214,219,223,227,229,232,233,236,241,243,244,247,248,251,252,253,254,255
[convolutional]
batch_normalize=1
filters=358
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky
non_zero_index=26,28,38,39,40,41,46,49,58,59,63,68,73,81,84,86,93,98,103,106,110,112,113,115,122,124,127,128,129,131,132,133,149,153,154,157,160,166,171,173,178,179,188,189,193,196,203,209,212,214,215,216,217,218,224,227,229,232,234,237,238,241,244,246,249,250,252
[convolutional]
batch_normalize=1
filters=358
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,2,4,6,7,8,10,11,12,13,15,16,17,18,20,21,23,24,25,30,32,33,34,35,36,37,38,42,43,45,46,47,50,52,53,54,55,56,58,59,61,62,65,68,69,70,71,72,73,74,76,78,80,82,83,86,87,89,90,92,94,95,96,98,100,101,102,103,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,131,132,133,134,135,136,137,138,139,141,142,144,145,146,148,151,152,153,154,155,157,158,159,160,161,162,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,196,198,199,200,201,202,204,207,208,211,213,214,216,218,219,220,222,223,224,231,232,233,234,235,237,238,240,242,243,245,246,247,248,252,253,254,255,256,257,260,261,264,265,266,268,271,272,273,274,275,277,279,280,282,284,285,286,289,290,293,294,296,297,298,299,300,301,302,304,305,306,308,310,313,314,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,362,363,364,366,367,369,370,371,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,393,394,395,396,399,401,402,403,404,406,407,409,410,411,412,413,414,415,417,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,455,456,459,461,462,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=133
size=3
stride=2
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,49,70,582,79,594,596,601,94,97,99,101,615,107,108,621,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,680,171,686,687,691,186,192,714,207,210,211,724,218,224,229,742,746,747,247,765,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,830,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,995,998,1009,1018
[convolutional]
batch_normalize=1
filters=23
size=1
stride=1
pad=1
activation=leaky
non_zero_index=287,301,302,333,337,359,364,399,402,417,425,427,429,432,433,445,446,454,466,490,498,500,508
[convolutional]
batch_normalize=1
filters=133
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,49,70,582,79,594,596,601,94,97,99,101,615,107,108,621,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,680,171,686,687,691,186,192,714,207,210,211,724,218,224,229,742,746,747,247,765,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,830,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,995,998,1009,1018
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=81
size=1
stride=1
pad=1
activation=leaky
non_zero_index=31,56,119,158,163,171,181,190,222,257,265,267,269,273,274,276,278,279,280,281,282,285,286,287,293,295,308,309,319,324,325,327,329,332,335,337,348,349,350,357,363,374,377,378,387,388,390,393,394,400,402,403,407,411,412,413,414,416,417,427,430,433,435,440,442,446,455,460,463,469,473,477,479,480,483,490,498,500,504,505,510
[convolutional]
batch_normalize=1
filters=133
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,49,70,582,79,594,596,601,94,97,99,101,615,107,108,621,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,680,171,686,687,691,186,192,714,207,210,211,724,218,224,229,742,746,747,247,765,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,830,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,995,998,1009,1018
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=36
size=1
stride=1
pad=1
activation=leaky
non_zero_index=172,214,265,273,282,285,300,316,317,318,319,323,325,330,334,337,344,349,361,370,379,386,407,417,418,421,425,445,447,451,460,465,475,476,488,502
[convolutional]
batch_normalize=1
filters=133
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,49,70,582,79,594,596,601,94,97,99,101,615,107,108,621,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,680,171,686,687,691,186,192,714,207,210,211,724,218,224,229,742,746,747,247,765,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,830,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,995,998,1009,1018
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=2
size=1
stride=1
pad=1
activation=leaky
non_zero_index=355,364
[convolutional]
batch_normalize=1
filters=133
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,49,70,582,79,594,596,601,94,97,99,101,615,107,108,621,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,680,171,686,687,691,186,192,714,207,210,211,724,218,224,229,742,746,747,247,765,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,830,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,995,998,1009,1018
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=90
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,2,10,13,14,37,42,57,71,73,74,75,77,81,84,86,87,88,94,97,100,104,126,129,133,140,147,150,155,159,165,170,172,186,188,196,210,212,215,228,229,232,244,248,254,256,262,267,270,271,290,292,301,302,304,305,309,310,316,321,327,332,333,344,349,356,373,378,383,385,393,394,395,396,397,406,409,415,430,434,435,443,459,463,475,481,483,485,492,507
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=134
activation=leaky
non_zero_index=4,16,19,26,28,37,56,58,59,62,77,78,100,108,119,123,127,130,131,153,159,161,170,172,174,176,180,188,197,205,207,208,229,238,251,255,257,259,263,295,299,302,317,326,338,340,341,345,354,361,367,377,387,391,392,393,402,405,416,417,419,423,424,450,452,490,495,506,522,532,533,535,546,553,567,568,570,573,584,587,594,596,611,624,644,648,649,654,669,673,674,683,699,733,736,738,750,767,772,777,789,801,803,812,815,816,822,830,832,867,873,877,878,888,894,909,914,919,926,937,938,944,953,959,961,962,963,971,976,986,987,996,997,1010
[convolutional]
batch_normalize=1
filters=74
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,8,11,16,37,44,56,60,63,68,76,84,103,105,107,121,129,132,144,158,160,178,204,207,217,220,246,267,269,270,275,285,306,313,316,322,339,348,351,353,360,362,368,382,397,404,405,408,414,417,419,421,422,423,424,432,434,439,440,442,446,450,451,454,475,478,483,485,488,492,493,505,510,511
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=147
activation=leaky
non_zero_index=3,5,10,14,19,36,41,46,54,57,66,67,97,106,107,109,117,124,126,127,151,155,168,173,177,178,188,206,210,231,252,255,257,260,268,274,291,296,308,311,316,321,332,348,350,369,372,373,376,394,403,407,414,425,427,428,433,434,440,441,448,449,452,466,472,479,482,483,493,510,521,528,537,540,541,547,555,569,575,582,590,616,645,650,651,653,654,655,673,678,681,683,684,702,703,715,718,735,744,745,748,762,773,774,776,779,780,782,787,793,804,809,823,829,832,834,842,848,853,854,867,879,885,887,894,895,897,900,909,913,914,915,931,934,940,951,958,976,977,978,991,995,1003,1006,1012,1018,1023
[convolutional]
batch_normalize=1
filters=63
size=1
stride=1
pad=1
activation=leaky
non_zero_index=9,19,27,49,68,86,96,100,115,116,119,136,137,139,142,143,149,151,158,160,173,196,210,218,226,231,240,242,262,267,268,274,286,287,288,298,303,304,321,327,331,359,365,373,375,379,380,384,387,390,391,396,402,417,419,423,451,455,463,476,486,497,509
[predict]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378,379,380,381,382,383,384,385,386,387,388,389,390,391,392,393,394,395,396,397,398,399,400,401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,420,421,422,423,424,425,426,427,428,429,430,431,432,433,434,435,436,437,438,439,440,441,442,443,444,445,446,447,448,449,450,451,452,453,454,455,456,457,458,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,479,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,501,502,503,504,505,506,507,508,509,510,511,512,513,514,515,516,517,518,519,520,521,522,523,524,525,526,527,528,529,530,531,532,533,534,535,536,537,538,539,540,541,542,543,544,545,546,547,548,549,550,551,552,553,554,555,556,557,558,559,560,561,562,563,564,565,566,567,568,569,570,571,572,573,574,575,576,577,578,579,580,581,582,583,584,585,586,587,588,589,590,591,592,593,594,595,596,597,598,599,600,601,602,603,604,605,606,607,608,609,610,611,612,613,614,615,616,617,618,619,620,621,622,623,624,625,626,627,628,629,630,631,632,633,634,635,636,637,638,639,640,641,642,643,644,645,646,647,648,649,650,651,652,653,654,655,656,657,658,659,660,661,662,663,664,665,666,667,668,669,670,671,672,673,674,675,676,677,678,679,680,681,682,683,684,685,686,687,688,689,690,691,692,693,694,695,696,697,698,699,700,701,702,703,704,705,706,707,708,709,710,711,712,713,714,715,716,717,718,719,720,721,722,723,724,725,726,727,728,729,730,731,732,733,734,735,736,737,738,739,740,741,742,743,744,745,746,747,748,749,750,751,752,753,754,755,756,757,758,759,760,761,762,763,764,765,766,767,768,769,770,771,772,773,774,775,776,777,778,779,780,781,782,783,784,785,786,787,788,789,790,791,792,793,794,795,796,797,798,799,800,801,802,803,804,805,806,807,808,809,810,811,812,813,814,815,816,817,818,819,820,821,822,823,824,825,826,827,828,829,830,831,832,833,834,835,836,837,838,839,840,841,842,843,844,845,846,847,848,849,850,851,852,853,854,855,856,857,858,859,860,861,862,863,864,865,866,867,868,869,870,871,872,873,874,875,876,877,878,879,880,881,882,883,884,885,886,887,888,889,890,891,892,893,894,895,896,897,898,899,900,901,902,903,904,905,906,907,908,909,910,911,912,913,914,915,916,917,918,919,920,921,922,923,924,925,926,927,928,929,930,931,932,933,934,935,936,937,938,939,940,941,942,943,944,945,946,947,948,949,950,951,952,953,954,955,956,957,958,959,960,961,962,963,964,965,966,967,968,969,970,971,972,973,974,975,976,977,978,979,980,981,982,983,984,985,986,987,988,989,990,991,992,993,994,995,996,997,998,999,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015,1016,1017,1018,1019,1020,1021,1022,1023
[predict]
batch_normalize=0
size=1
stride=1
pad=1
filters=75
activation=linear
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74
[yolo]
mask=6,7,8
anchors=10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=20
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
[route]
layers=-4
non_zero_index=9,19,27,49,68,86,96,100,115,116,119,136,137,139,142,143,149,151,158,160,173,196,210,218,226,231,240,242,262,267,268,274,286,287,288,298,303,304,321,327,331,359,365,373,375,379,380,384,387,390,391,396,402,417,419,423,451,455,463,476,486,497,509
[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky
non_zero_index=3,5,30,31,33,36,42,46,56,57,73,83,88,90,101,105,118,121,122,143,146,149,166,167,173,180,184,194,199,229,239,246,252
[upsample]
stride=2
[route]
layers=-1, 61
non_zero_index=3,5,30,31,33,36,42,46,56,57,73,83,88,90,101,105,118,121,122,143,146,149,166,167,173,180,184,194,199,229,239,246,252,256,258,260,262,263,264,266,267,268,269,271,272,273,274,276,277,279,280,281,286,288,289,290,291,292,293,294,298,299,301,302,303,306,308,309,310,311,312,314,315,317,318,321,324,325,326,327,328,329,330,332,334,336,338,339,342,343,345,346,348,350,351,352,354,356,357,358,359,361,362,363,365,366,369,370,371,372,375,376,377,380,381,383,384,387,388,389,390,391,392,393,394,395,397,398,400,401,402,404,407,408,409,410,411,413,414,415,416,417,418,421,422,423,425,427,429,430,431,432,433,434,437,438,439,440,441,442,444,445,446,447,448,449,452,454,455,456,457,458,460,463,464,467,469,470,472,474,475,476,478,479,480,487,488,489,490,491,493,494,496,498,499,501,502,503,504,508,509,510,511,512,513,516,517,520,521,522,524,527,528,529,530,531,533,535,536,538,540,541,542,545,546,549,550,552,553,554,555,556,557,558,560,561,562,564,566,569,570,572,574,575,576,578,579,580,581,582,583,584,585,586,587,590,591,592,593,594,595,596,597,601,602,603,604,605,607,608,609,610,611,613,614,615,616,618,619,620,622,623,625,626,627,629,630,631,632,634,635,636,637,638,639,640,641,642,643,645,646,649,650,651,652,655,657,658,659,660,662,663,665,666,667,668,669,670,671,673,676,678,679,681,682,683,685,686,687,691,692,697,698,699,701,702,703,704,705,706,707,708,709,711,712,715,717,718,720,721,722,723,724,725,726,727,728,729,730,731,732,733,734,736,737,738,739,740,743,744,745,746,747,748,749,750,751,752,753,754,755,756,758,759,760,761,762,764,765,766,767
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,3,4,9,10,13,14,18,20,22,24,26,27,28,33,34,35,40,43,44,45,47,49,51,52,53,58,59,60,62,64,66,68,74,75,77,79,80,82,85,87,93,94,95,96,98,100,102,104,105,107,108,109,112,113,117,119,120,122,124,127,130,132,135,136,138,139,140,143,144,145,152,153,154,155,156,158,159,160,162,163,165,168,169,171,173,175,176,177,178,180,181,183,184,185,189,190,191,192,193,196,197,199,202,208,215,216,217,221,225,226,231,235,236,237,238,239,241,242,244,245,247,248,249,250,252,254,255
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=184
activation=leaky
non_zero_index=3,5,6,8,10,12,13,14,19,21,22,28,40,41,42,45,47,51,53,54,56,57,59,64,65,66,69,78,81,82,84,85,87,89,90,91,95,99,100,103,105,107,108,109,114,119,122,128,130,131,132,133,134,136,142,146,147,151,152,154,159,160,163,167,172,174,180,186,187,190,191,197,200,202,203,206,207,208,213,216,217,220,222,225,226,227,228,229,232,233,236,237,238,241,244,245,248,252,254,261,263,265,269,271,273,280,282,283,285,291,292,294,301,303,306,307,311,318,320,325,329,340,345,346,348,350,351,353,354,355,356,358,360,361,364,369,374,377,378,379,381,383,387,392,393,396,397,401,403,405,406,415,419,422,423,428,431,434,436,437,438,439,440,444,446,450,452,456,458,459,462,465,471,473,479,480,482,485,486,487,489,498,504,507
[convolutional]
batch_normalize=1
filters=121
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,5,10,11,12,15,17,20,22,26,27,28,35,37,38,40,41,42,44,45,49,50,51,52,53,54,59,61,66,67,69,70,72,76,78,79,83,84,91,93,94,96,97,98,99,100,101,102,104,107,111,112,114,115,116,121,123,125,127,128,129,132,133,136,139,140,142,145,149,150,152,154,156,157,158,159,161,163,165,166,168,169,170,175,177,179,181,182,185,186,189,191,193,195,198,205,207,208,211,214,215,217,219,221,223,224,227,229,230,231,233,234,237,238,241,244,247,249,250,252,254
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=143
activation=leaky
non_zero_index=9,11,24,26,27,29,33,35,37,45,48,54,55,57,58,59,62,68,70,72,73,74,77,81,95,98,102,106,114,117,118,125,127,135,136,138,141,146,148,153,162,165,169,181,183,185,188,191,194,199,202,204,205,207,209,210,217,218,219,220,221,229,233,249,250,257,259,260,262,264,267,268,269,271,272,274,275,281,290,295,296,302,308,309,319,320,326,328,330,335,336,337,338,349,350,351,352,353,356,357,360,362,363,364,366,367,371,374,383,385,386,387,391,394,396,397,398,399,409,412,413,417,423,434,437,441,442,446,451,457,459,465,468,473,474,475,477,478,489,498,504,506,508
[convolutional]
batch_normalize=1
filters=85
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,3,9,12,13,16,17,18,19,21,23,24,25,32,34,35,38,40,41,42,45,46,50,54,57,60,68,69,70,72,75,76,78,79,83,92,93,101,104,106,116,121,122,127,128,129,131,134,136,139,144,148,151,152,153,154,155,156,158,160,174,176,178,183,187,189,191,193,207,217,220,223,227,229,231,232,234,235,239,242,246,247,249,252,254
[predict]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378,379,380,381,382,383,384,385,386,387,388,389,390,391,392,393,394,395,396,397,398,399,400,401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,420,421,422,423,424,425,426,427,428,429,430,431,432,433,434,435,436,437,438,439,440,441,442,443,444,445,446,447,448,449,450,451,452,453,454,455,456,457,458,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,479,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,501,502,503,504,505,506,507,508,509,510,511
[predict]
batch_normalize=0
size=1
stride=1
pad=1
filters=75
activation=linear
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74
[yolo]
mask=3,4,5
anchors=10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=20
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
[route]
layers=-4
non_zero_index=0,3,9,12,13,16,17,18,19,21,23,24,25,32,34,35,38,40,41,42,45,46,50,54,57,60,68,69,70,72,75,76,78,79,83,92,93,101,104,106,116,121,122,127,128,129,131,134,136,139,144,148,151,152,153,154,155,156,158,160,174,176,178,183,187,189,191,193,207,217,220,223,227,229,231,232,234,235,239,242,246,247,249,252,254
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,3,4,5,8,10,12,14,18,20,21,22,28,30,31,36,39,40,41,43,44,45,51,54,55,57,58,61,63,65,67,68,69,70,71,72,73,78,79,80,81,82,86,88,92,94,95,100,101,102,103,104,107,110,111,112,115,116,117,120,121,124,125,127
