[net]
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.00001
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.0001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1
[convolutional]
batch_normalize=1
filters=23
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,7,8,9,10,11,12,13,14,16,17,19,22,23,24,25,26,27,28,30,31
[convolutional]
batch_normalize=1
filters=55
size=3
stride=2
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,13,14,15,16,17,18,19,20,21,22,23,25,27,28,30,31,32,33,34,35,36,38,39,40,41,42,43,44,46,47,48,49,52,54,55,56,57,58,59,60,61,62,63
[convolutional]
batch_normalize=1
filters=23
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,2,4,5,7,9,12,13,14,15,16,17,18,19,21,24,25,26,27,28,29,30,31
[convolutional]
batch_normalize=1
filters=55
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,13,14,15,16,17,18,19,20,21,22,23,25,27,28,30,31,32,33,34,35,36,38,39,40,41,42,43,44,46,47,48,49,52,54,55,56,57,58,59,60,61,62,63
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=114
size=3
stride=2
pad=1
activation=leaky
non_zero_index=1,2,3,4,5,6,7,9,10,11,12,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,39,40,41,43,44,45,46,47,48,49,50,51,53,54,55,56,57,58,59,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,89,91,92,93,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,120,122,123,125,126,127
[convolutional]
batch_normalize=1
filters=40
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,2,5,6,7,8,10,11,12,13,14,16,18,19,20,21,22,26,28,31,32,33,36,39,41,42,44,45,46,47,48,49,51,53,55,56,57,58,59,61
[convolutional]
batch_normalize=1
filters=114
size=3
stride=1
pad=1
activation=leaky
non_zero_index=1,2,3,4,5,6,7,9,10,11,12,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,39,40,41,43,44,45,46,47,48,49,50,51,53,54,55,56,57,58,59,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,89,91,92,93,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,120,122,123,125,126,127
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=45
size=1
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,7,8,9,10,13,15,16,17,19,20,21,23,24,25,26,28,29,30,33,34,35,36,37,38,39,40,42,45,47,48,50,51,53,54,55,56,57,58,59,61,62,63
[convolutional]
batch_normalize=1
filters=114
size=3
stride=1
pad=1
activation=leaky
non_zero_index=1,2,3,4,5,6,7,9,10,11,12,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,39,40,41,43,44,45,46,47,48,49,50,51,53,54,55,56,57,58,59,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,89,91,92,93,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,120,122,123,125,126,127
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=255
size=3
stride=2
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[convolutional]
batch_normalize=1
filters=58
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,7,11,15,16,18,19,22,23,27,29,35,36,38,45,46,48,52,53,54,55,57,58,61,64,65,68,70,71,73,75,77,79,80,81,82,83,85,94,97,100,102,103,104,109,110,111,112,113,115,116,117,119,121,122,125,126,127
[convolutional]
batch_normalize=1
filters=255
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,2,5,6,7,8,11,13,14,16,19,20,21,22,23,24,27,30,31,32,34,42,43,48,49,50,52,53,56,58,60,62,63,64,65,66,69,70,72,73,74,75,76,78,80,82,83,84,85,87,89,91,92,93,94,95,97,98,99,103,105,107,111,112,113,115,116,117,119,121,122,127
[convolutional]
batch_normalize=1
filters=255
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=90
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,5,7,8,9,11,14,15,16,17,19,21,25,26,27,28,29,30,32,33,34,35,38,40,42,44,45,46,48,49,50,52,54,55,56,57,58,60,61,62,66,67,68,69,70,71,72,73,75,78,80,81,82,83,84,85,86,87,89,90,91,93,95,96,97,99,100,101,102,104,105,107,108,110,112,113,114,116,117,118,119,121,122,124,125,126,127
[convolutional]
batch_normalize=1
filters=255
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=90
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,3,6,7,8,9,10,11,12,13,17,18,21,24,26,27,28,29,30,32,35,37,38,40,43,44,45,47,48,49,51,52,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,71,72,73,75,76,77,78,79,80,81,82,84,85,86,87,88,89,90,93,94,95,96,97,98,99,100,103,104,105,106,107,108,112,114,115,116,117,119,121,123,124,125,126
[convolutional]
batch_normalize=1
filters=255
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=90
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,2,3,4,5,6,7,8,9,12,13,14,15,16,18,19,20,22,23,24,25,27,28,29,30,33,34,35,37,39,40,41,42,44,46,47,48,49,51,52,53,57,58,61,62,63,64,65,67,68,73,75,76,77,78,79,81,82,84,85,86,87,90,91,92,93,96,97,99,100,101,103,104,105,107,110,112,113,114,115,116,117,118,119,120,122,123,124,125,127
[convolutional]
batch_normalize=1
filters=255
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=90
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,4,5,6,7,8,9,11,14,15,17,19,21,22,23,25,26,27,28,32,33,35,36,37,38,40,41,42,43,44,45,46,47,48,49,51,52,54,56,57,58,59,60,61,64,65,67,69,70,71,72,73,74,76,77,78,79,80,81,85,87,89,90,91,92,93,96,98,101,103,105,106,108,109,110,111,112,113,114,115,116,117,118,120,122,125,126,127
[convolutional]
batch_normalize=1
filters=255
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=90
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,2,3,7,8,9,12,16,18,20,21,22,23,25,26,27,29,30,31,33,36,37,38,39,40,41,43,44,45,47,49,50,51,52,53,54,56,57,58,60,61,62,66,67,69,70,71,73,74,76,79,80,81,83,84,86,87,90,91,92,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,111,112,113,114,115,116,117,118,119,122,123,124,126,127
[convolutional]
batch_normalize=1
filters=255
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=90
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,3,4,5,6,7,8,12,14,15,16,18,19,22,23,24,27,28,29,30,32,33,34,35,36,37,39,40,41,42,43,44,45,46,47,49,52,55,57,58,59,60,61,62,63,65,66,68,69,70,72,73,76,77,78,81,82,83,85,86,87,88,91,94,95,96,97,98,100,103,104,105,106,107,108,109,110,111,114,115,116,117,119,120,121,122,123,124,125,127
[convolutional]
batch_normalize=1
filters=255
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=420
size=3
stride=2
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,3,4,5,6,7,15,18,19,28,30,39,41,52,59,75,77,78,81,88,103,110,121,125,128,129,130,133,135,139,142,143,144,147,148,152,155,157,159,160,161,163,172,174,176,177,180,181,182,184,186,188,189,190,191,193,194,199,205,206,208,209,210,211,214,215,216,218,221,222,223,225,231,233,234,239,241,243,246,255
[convolutional]
batch_normalize=1
filters=420
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=139
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,4,16,17,18,19,20,24,25,26,41,46,48,49,54,57,59,60,62,65,66,68,72,76,77,78,81,82,83,86,87,91,95,98,99,102,104,107,109,110,112,113,114,115,117,118,119,120,121,122,124,125,128,131,133,134,135,137,138,140,142,143,145,146,147,148,149,150,151,153,154,155,156,157,160,161,162,163,164,166,168,169,172,174,175,176,177,178,179,180,181,182,183,184,185,187,188,190,192,199,207,212,213,216,217,218,219,221,222,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,251,252,253,254,255
[convolutional]
batch_normalize=1
filters=420
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=103
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,2,8,9,14,17,20,21,25,26,27,33,39,41,43,44,46,47,48,49,51,53,54,56,61,62,65,68,73,76,80,82,84,88,95,97,99,107,108,110,111,113,115,118,120,122,123,125,126,128,129,131,132,134,136,139,141,146,148,149,151,153,154,156,164,165,166,167,172,175,177,179,180,182,183,186,189,191,192,193,195,197,203,204,208,212,214,216,217,218,223,224,226,229,230,235,238,243,245,246,247,249,250
[convolutional]
batch_normalize=1
filters=420
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=110
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,7,8,9,10,15,16,27,35,36,37,39,40,41,43,46,47,49,52,56,57,69,70,71,73,75,78,79,80,82,89,94,98,100,101,102,104,106,107,108,111,112,113,114,116,117,120,123,124,125,126,129,130,131,135,136,139,144,145,148,150,152,160,162,163,164,165,166,169,172,173,174,177,178,179,180,182,190,191,192,194,203,204,206,209,210,212,213,215,218,220,221,222,225,226,232,233,235,236,237,242,246,247,248,249,251,253,254
[convolutional]
batch_normalize=1
filters=420
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=146
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,5,6,7,8,12,14,16,17,18,19,20,22,25,26,30,33,35,38,40,42,45,51,52,53,59,61,62,64,66,67,70,71,73,74,77,78,79,81,83,84,85,86,87,88,89,91,92,93,94,95,98,99,103,104,105,106,107,109,110,111,112,113,115,116,120,121,122,123,124,125,128,129,130,131,133,134,135,136,137,139,140,141,142,143,145,146,147,148,149,150,152,153,155,156,158,160,161,163,164,165,166,167,168,169,170,171,172,174,177,178,179,180,181,190,193,199,200,201,204,206,211,212,215,217,219,222,223,225,229,234,237,239,241,242,243,244,245,247,248,250,251,252,255
[convolutional]
batch_normalize=1
filters=420
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=101
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,3,5,6,7,14,15,16,18,20,29,31,34,36,38,41,44,45,48,49,50,52,57,62,64,67,68,69,71,72,75,77,79,82,83,85,86,89,93,96,97,99,100,104,110,111,114,118,121,123,124,129,131,132,135,136,139,140,143,144,145,146,147,150,152,154,157,160,168,169,171,172,174,177,178,182,183,186,189,190,191,194,196,200,204,205,209,214,215,217,220,221,227,228,231,232,240,245,249,252,254
[convolutional]
batch_normalize=1
filters=420
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=144
size=1
stride=1
pad=1
activation=leaky
non_zero_index=3,4,7,8,9,11,16,17,20,22,27,29,30,35,37,42,43,50,53,54,58,60,65,66,75,78,82,86,89,91,93,98,99,100,103,105,106,107,108,109,110,112,113,114,115,117,118,120,121,122,123,124,125,128,129,130,132,133,134,135,136,138,139,144,145,146,148,149,150,151,152,153,154,155,156,157,158,159,160,162,164,165,166,167,169,170,171,172,173,174,175,176,177,178,180,181,184,185,186,187,189,190,191,195,196,197,200,203,208,209,211,214,215,216,217,219,220,222,224,226,227,228,229,230,233,234,235,236,237,238,239,240,241,243,244,247,248,249,250,251,252,253,254,255
[convolutional]
batch_normalize=1
filters=420
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=132
size=1
stride=1
pad=1
activation=leaky
non_zero_index=4,5,21,24,26,28,32,34,37,38,39,40,41,46,48,49,50,58,59,63,66,68,73,81,84,86,93,98,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,119,121,122,123,124,125,126,127,128,129,131,132,133,135,138,139,141,142,144,146,148,149,152,153,154,155,156,160,162,164,166,167,171,172,173,174,175,178,179,181,182,183,184,185,187,188,189,190,192,193,195,196,203,206,208,209,212,214,215,216,217,218,219,220,221,224,226,227,228,229,231,232,233,234,235,237,238,239,240,241,243,244,245,246,247,249,250,252,254
[convolutional]
batch_normalize=1
filters=420
size=3
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,10,11,12,13,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,52,53,54,55,56,58,59,61,62,65,66,67,68,69,70,71,72,73,74,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,94,95,96,97,98,100,101,102,103,104,105,106,107,109,110,113,114,115,116,119,120,121,124,125,127,128,129,131,132,133,134,135,136,137,138,139,141,142,144,145,146,147,148,149,151,152,153,154,155,157,158,159,160,161,162,163,165,166,167,169,171,173,174,175,176,177,178,181,182,183,184,185,186,188,189,190,191,192,193,194,196,197,198,199,200,201,202,203,204,206,207,208,211,213,214,216,217,218,219,220,222,223,224,228,230,231,232,233,234,235,237,238,239,240,241,242,243,245,246,247,248,251,252,253,254,255,256,257,258,259,260,261,263,264,265,266,267,268,270,271,272,273,274,275,276,277,278,279,280,282,284,285,286,289,290,293,294,295,296,297,298,299,300,301,302,304,305,306,308,310,313,314,315,316,318,319,320,322,323,324,325,326,327,328,329,330,331,334,335,336,337,338,339,340,341,345,346,347,348,349,351,352,353,354,355,357,358,359,360,361,362,363,364,365,366,367,369,370,371,372,373,374,375,376,378,379,380,381,382,383,384,385,386,387,389,390,391,392,393,394,395,396,398,399,400,401,402,403,404,406,407,409,410,411,412,413,414,415,417,418,420,422,423,425,426,427,429,430,431,435,436,441,442,443,445,446,447,448,449,450,451,452,453,454,455,456,457,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,502,503,504,505,506,508,509,510,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=150
size=3
stride=2
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,47,49,57,70,582,79,594,596,601,94,97,99,101,615,619,108,621,107,114,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,676,680,171,684,173,686,687,691,186,192,714,207,210,211,724,218,224,229,742,743,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,818,830,320,323,330,842,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,403,918,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,483,995,485,998,1009,1018,507
[convolutional]
batch_normalize=1
filters=237
size=1
stride=1
pad=1
activation=leaky
non_zero_index=92,125,127,154,156,157,158,159,161,162,164,166,168,169,170,171,172,173,174,175,176,177,178,179,182,183,184,185,186,187,189,191,192,193,194,196,197,198,199,201,203,204,206,207,208,209,210,211,213,214,215,217,218,219,221,224,225,226,227,228,229,230,231,232,233,234,236,237,238,239,240,241,242,243,244,245,247,248,249,250,254,256,257,258,259,263,264,265,269,270,272,274,275,276,277,279,280,283,284,285,286,287,288,289,291,292,293,294,296,297,298,302,303,304,306,307,308,309,310,311,314,315,316,318,319,322,323,324,327,330,333,337,338,340,344,348,350,352,353,354,355,356,358,359,360,361,362,365,366,367,368,370,372,373,374,375,376,377,379,380,382,383,384,386,387,388,389,391,392,398,399,400,402,405,406,408,409,410,412,414,415,417,418,419,420,424,425,427,428,429,430,432,433,435,436,437,438,439,442,444,445,446,452,454,455,456,458,460,461,462,466,467,468,469,471,472,474,476,479,480,483,484,486,487,488,489,491,493,496,498,499,500,502,506,507,510,511
[convolutional]
batch_normalize=1
filters=150
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,47,49,57,70,582,79,594,596,601,94,97,99,101,615,619,108,621,107,114,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,676,680,171,684,173,686,687,691,186,192,714,207,210,211,724,218,224,229,742,743,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,818,830,320,323,330,842,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,403,918,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,483,995,485,998,1009,1018,507
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=317
size=1
stride=1
pad=1
activation=leaky
non_zero_index=31,33,34,35,37,46,56,93,109,119,127,130,131,135,136,138,139,140,146,152,158,160,161,162,163,164,165,166,168,169,170,171,174,175,177,178,179,180,181,183,184,185,189,190,191,192,193,195,196,197,198,199,200,201,203,205,206,207,208,209,210,211,212,213,214,215,216,217,219,220,221,222,229,230,231,232,233,234,235,238,239,240,241,243,244,246,247,248,249,250,251,256,257,258,259,260,261,262,263,264,265,267,271,272,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,303,304,305,306,307,308,309,310,311,312,313,314,315,317,318,319,320,321,322,323,324,326,327,328,329,330,331,332,333,335,336,337,338,339,340,341,343,344,346,347,348,349,350,351,352,353,354,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,376,377,378,379,380,381,382,383,384,385,386,387,388,389,390,391,392,393,395,396,397,399,400,401,402,403,404,405,406,407,408,409,411,412,413,414,415,416,417,421,422,423,424,425,426,427,428,429,430,432,433,434,435,436,437,438,439,442,443,444,445,446,447,448,449,451,452,453,454,455,456,457,458,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,480,481,482,483,484,486,487,489,490,492,493,494,495,496,497,498,499,500,501,502,503,504,505,507,508,509,510
[convolutional]
batch_normalize=1
filters=150
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,47,49,57,70,582,79,594,596,601,94,97,99,101,615,619,108,621,107,114,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,676,680,171,684,173,686,687,691,186,192,714,207,210,211,724,218,224,229,742,743,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,818,830,320,323,330,842,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,403,918,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,483,995,485,998,1009,1018,507
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=230
size=1
stride=1
pad=1
activation=leaky
non_zero_index=22,127,129,130,131,135,136,137,163,164,165,166,168,169,170,171,172,173,176,177,178,182,183,184,186,187,189,191,193,194,197,198,199,200,201,202,203,204,205,206,207,208,211,213,214,217,218,223,224,225,226,227,228,229,230,232,233,235,238,242,245,246,247,249,250,251,254,256,257,258,259,260,262,264,265,266,267,268,273,274,275,276,277,278,280,281,282,283,284,285,286,288,289,290,291,292,293,294,295,296,297,298,299,300,301,303,304,305,306,307,308,310,311,312,316,322,323,326,328,329,330,332,334,336,337,338,339,341,342,343,345,346,349,350,352,354,357,359,360,362,363,365,366,367,368,372,373,374,375,376,377,379,380,381,384,385,386,391,392,395,396,400,401,402,403,406,407,408,412,414,415,421,423,424,425,427,429,430,431,434,437,438,439,441,445,446,447,450,451,452,453,454,455,458,460,462,463,464,465,466,467,468,469,471,472,473,474,475,477,479,480,481,483,484,486,487,488,490,491,492,494,498,499,501,502,503,504,505,506,508
[convolutional]
batch_normalize=1
filters=150
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,47,49,57,70,582,79,594,596,601,94,97,99,101,615,619,108,621,107,114,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,676,680,171,684,173,686,687,691,186,192,714,207,210,211,724,218,224,229,742,743,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,818,830,320,323,330,842,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,403,918,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,483,995,485,998,1009,1018,507
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=75
size=1
stride=1
pad=1
activation=leaky
non_zero_index=159,162,166,167,175,176,179,180,182,188,192,197,200,203,208,213,218,223,226,229,231,236,244,249,258,261,270,271,279,280,291,294,305,314,320,323,326,327,328,332,344,350,351,353,364,368,370,373,381,392,393,402,404,408,412,413,414,417,418,422,423,438,439,442,454,459,466,469,471,479,482,485,487,491,506
[convolutional]
batch_normalize=1
filters=150
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,31,549,43,557,47,49,57,70,582,79,594,596,601,94,97,99,101,615,619,108,621,107,114,626,116,629,630,119,631,124,639,130,134,650,655,144,145,664,672,676,680,171,684,173,686,687,691,186,192,714,207,210,211,724,218,224,229,742,743,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,803,292,804,807,810,815,816,818,830,320,323,330,842,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,403,918,421,423,425,943,437,949,950,954,447,964,453,455,456,967,968,461,974,976,468,981,983,989,991,481,483,995,485,998,1009,1018,507
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,2,7,10,13,14,18,22,27,37,42,57,67,68,71,73,74,75,77,81,84,86,87,88,94,97,100,104,108,109,113,126,129,133,134,140,146,147,150,152,155,158,159,165,170,172,186,188,192,194,195,196,204,207,209,210,212,215,217,218,221,227,228,229,232,233,241,242,243,244,245,247,248,254,256,259,260,262,263,264,265,266,267,268,270,271,275,276,277,279,280,282,285,288,290,292,293,294,299,301,302,303,304,305,307,309,310,311,315,316,317,319,320,321,322,324,325,327,330,332,333,335,338,340,343,344,349,350,351,356,358,360,361,362,364,365,368,369,373,378,379,380,383,385,393,394,395,396,397,402,405,406,407,409,411,412,415,430,434,435,439,440,441,443,446,450,455,456,457,458,459,463,468,471,475,476,477,481,482,483,485,489,491,492,498,499,504,507,508,509,510
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=159
activation=leaky
non_zero_index=4,15,16,19,26,28,30,37,56,58,59,62,77,78,93,100,108,111,119,123,125,127,130,131,153,159,161,170,172,174,176,180,187,188,197,205,207,208,222,229,238,251,255,257,259,263,295,299,302,306,317,326,338,340,341,345,354,361,362,367,377,387,391,392,393,396,402,405,416,417,419,423,424,430,450,452,490,494,495,506,522,532,533,535,537,545,546,552,553,567,568,570,573,582,584,587,594,596,599,611,624,644,648,649,651,654,669,673,674,683,699,733,736,738,740,750,767,772,777,779,786,789,801,803,812,815,816,818,822,830,832,851,867,873,877,878,888,894,907,909,914,919,926,937,938,944,953,957,959,961,962,963,971,976,986,987,996,997,1010
[convolutional]
batch_normalize=1
filters=141
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,8,11,16,32,36,37,40,42,44,46,48,55,56,60,63,67,68,76,84,103,105,107,113,121,129,131,132,144,158,160,178,196,197,204,207,210,211,217,220,230,231,234,238,246,267,269,270,275,278,281,285,289,290,292,294,297,299,306,307,311,312,313,316,318,321,322,324,326,332,336,339,343,344,345,347,348,349,351,353,358,360,362,367,368,374,376,377,378,382,383,393,397,404,405,408,414,415,416,417,419,421,422,423,424,425,429,432,434,435,439,440,441,442,446,449,450,451,454,455,456,465,470,472,473,475,478,479,483,485,488,489,492,493,496,497,498,504,505,510,511
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=172
activation=leaky
non_zero_index=3,5,10,14,15,19,36,41,46,54,57,66,67,97,106,107,109,117,124,126,127,151,154,155,167,168,169,173,177,178,181,188,206,210,231,241,252,255,257,260,268,274,280,281,291,296,307,308,311,314,316,321,331,332,348,350,360,369,370,372,373,376,394,403,407,414,425,427,428,433,434,440,441,448,449,452,466,472,479,482,483,493,510,521,528,529,537,540,541,547,552,555,568,569,574,575,582,585,590,616,622,645,650,651,653,654,655,661,673,678,679,681,683,684,702,703,715,718,720,735,744,745,748,762,773,774,776,779,780,782,787,792,793,796,804,809,823,829,832,834,842,848,853,854,867,879,885,887,894,895,897,900,909,913,914,915,920,931,934,940,951,958,976,977,978,991,995,1003,1006,1012,1018,1023
[convolutional]
batch_normalize=1
filters=86
size=1
stride=1
pad=1
activation=leaky
non_zero_index=9,19,27,46,49,52,68,70,86,96,100,115,116,119,136,137,139,142,143,144,149,151,158,159,160,165,173,177,188,193,196,197,210,218,226,231,240,241,242,243,259,262,267,268,273,274,286,287,288,298,302,303,304,318,321,324,327,331,339,341,355,359,365,373,375,379,380,384,387,390,391,396,402,417,419,423,429,432,437,451,455,463,476,486,497,509
[predict]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378,379,380,381,382,383,384,385,386,387,388,389,390,391,392,393,394,395,396,397,398,399,400,401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,420,421,422,423,424,425,426,427,428,429,430,431,432,433,434,435,436,437,438,439,440,441,442,443,444,445,446,447,448,449,450,451,452,453,454,455,456,457,458,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,479,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,501,502,503,504,505,506,507,508,509,510,511,512,513,514,515,516,517,518,519,520,521,522,523,524,525,526,527,528,529,530,531,532,533,534,535,536,537,538,539,540,541,542,543,544,545,546,547,548,549,550,551,552,553,554,555,556,557,558,559,560,561,562,563,564,565,566,567,568,569,570,571,572,573,574,575,576,577,578,579,580,581,582,583,584,585,586,587,588,589,590,591,592,593,594,595,596,597,598,599,600,601,602,603,604,605,606,607,608,609,610,611,612,613,614,615,616,617,618,619,620,621,622,623,624,625,626,627,628,629,630,631,632,633,634,635,636,637,638,639,640,641,642,643,644,645,646,647,648,649,650,651,652,653,654,655,656,657,658,659,660,661,662,663,664,665,666,667,668,669,670,671,672,673,674,675,676,677,678,679,680,681,682,683,684,685,686,687,688,689,690,691,692,693,694,695,696,697,698,699,700,701,702,703,704,705,706,707,708,709,710,711,712,713,714,715,716,717,718,719,720,721,722,723,724,725,726,727,728,729,730,731,732,733,734,735,736,737,738,739,740,741,742,743,744,745,746,747,748,749,750,751,752,753,754,755,756,757,758,759,760,761,762,763,764,765,766,767,768,769,770,771,772,773,774,775,776,777,778,779,780,781,782,783,784,785,786,787,788,789,790,791,792,793,794,795,796,797,798,799,800,801,802,803,804,805,806,807,808,809,810,811,812,813,814,815,816,817,818,819,820,821,822,823,824,825,826,827,828,829,830,831,832,833,834,835,836,837,838,839,840,841,842,843,844,845,846,847,848,849,850,851,852,853,854,855,856,857,858,859,860,861,862,863,864,865,866,867,868,869,870,871,872,873,874,875,876,877,878,879,880,881,882,883,884,885,886,887,888,889,890,891,892,893,894,895,896,897,898,899,900,901,902,903,904,905,906,907,908,909,910,911,912,913,914,915,916,917,918,919,920,921,922,923,924,925,926,927,928,929,930,931,932,933,934,935,936,937,938,939,940,941,942,943,944,945,946,947,948,949,950,951,952,953,954,955,956,957,958,959,960,961,962,963,964,965,966,967,968,969,970,971,972,973,974,975,976,977,978,979,980,981,982,983,984,985,986,987,988,989,990,991,992,993,994,995,996,997,998,999,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015,1016,1017,1018,1019,1020,1021,1022,1023
[predict]
batch_normalize=0
size=1
stride=1
pad=1
filters=75
