[net]
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0001
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.0001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1
[convolutional]
batch_normalize=1
filters=4
size=3
stride=1
pad=1
activation=leaky
non_zero_index=11,12,16,26
[convolutional]
batch_normalize=1
filters=14
size=3
stride=2
pad=1
activation=leaky
non_zero_index=2,7,39,42,11,44,13,47,48,17,22,54,56,31
[convolutional]
batch_normalize=1
filters=4
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,18,19,25
[convolutional]
batch_normalize=1
filters=14
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,7,39,42,11,44,13,47,48,17,22,54,56,31
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=39
size=3
stride=2
pad=1
activation=leaky
non_zero_index=1,9,10,14,16,17,20,24,28,30,31,32,33,35,39,43,46,48,54,55,61,62,68,69,70,72,73,74,76,89,92,100,103,105,106,109,115,126,127
[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
activation=leaky
non_zero_index=11,14,18,36,51,53,61
[convolutional]
batch_normalize=1
filters=39
size=3
stride=1
pad=1
activation=leaky
non_zero_index=1,9,10,14,16,17,20,24,28,30,31,32,33,35,39,43,46,48,54,55,61,62,68,69,70,72,73,74,76,89,92,100,103,105,106,109,115,126,127
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
activation=leaky
non_zero_index=15,17,30,37,38,48,61
[convolutional]
batch_normalize=1
filters=39
size=3
stride=1
pad=1
activation=leaky
non_zero_index=1,9,10,14,16,17,20,24,28,30,31,32,33,35,39,43,46,48,54,55,61,62,68,69,70,72,73,74,76,89,92,100,103,105,106,109,115,126,127
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=148
size=3
stride=2
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=15,23,35,36,45,46,64,71,102,103,104,113,126
[convolutional]
batch_normalize=1
filters=148
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=5,7,8,20,21,73,74,83,98,99,113,119,121
[convolutional]
batch_normalize=1
filters=148
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,8,26,44,50,57,67,71,83,99,117,121,126
[convolutional]
batch_normalize=1
filters=148
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=11,21,29,54,59,61,64,73,82,100,104,108,124
[convolutional]
batch_normalize=1
filters=148
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=5,25,33,34,53,68,81,85,90,97,101,107,114
[convolutional]
batch_normalize=1
filters=148
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=38,40,45,47,60,71,78,79,81,85,90,106,120
[convolutional]
batch_normalize=1
filters=148
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=18,27,36,39,41,49,51,57,74,79,95,111,126
[convolutional]
batch_normalize=1
filters=148
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=3,6,7,24,28,29,41,45,52,62,85,122,124
[convolutional]
batch_normalize=1
filters=148
size=3
stride=1
pad=1
activation=leaky
non_zero_index=3,4,5,6,7,8,10,11,12,13,14,16,17,18,19,24,25,26,29,30,31,33,35,36,37,41,43,44,45,46,51,53,54,55,56,57,59,60,62,65,68,70,71,72,74,75,76,77,79,80,81,83,86,88,89,90,91,96,97,99,100,103,104,105,106,108,109,111,113,114,115,117,118,120,121,122,123,124,125,127,128,130,131,132,133,137,138,139,141,142,143,144,147,151,152,153,157,159,160,161,162,164,172,173,174,176,177,178,180,182,184,185,186,187,191,192,193,195,196,199,200,201,202,203,206,207,209,210,211,212,214,216,217,218,220,223,225,227,232,237,238,239,240,246,249,250,253,255
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=251
size=3
stride=2
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,7,15,18,19,30,39,41,59,75,78,81,110,121,125,128,129,130,135,139,189,191,206,208,221,255
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,4,19,41,49,62,72,76,77,78,86,91,95,107,124,149,179,180,192,207,212,218,221,227,236,240
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=9,21,27,48,49,53,62,65,73,84,88,107,111,120,132,136,149,172,179,191,192,195,203,212,214,224
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=9,10,16,36,43,46,56,71,73,100,106,107,117,124,126,129,165,172,173,177,179,182,203,222,232,248
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,2,6,8,14,22,42,45,51,53,64,67,78,98,111,112,128,137,160,161,167,199,204,222,229,255
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,3,5,16,20,36,57,62,67,69,71,72,75,89,96,99,114,123,131,135,171,178,183,194,227,231
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=7,17,50,58,65,66,89,99,100,103,107,117,133,135,148,165,172,181,187,203,211,227,233,243,244,248
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=26,38,39,40,41,46,49,58,86,110,112,124,128,131,154,160,166,171,196,212,218,227,232,238,250,252
[convolutional]
batch_normalize=1
filters=251
size=3
stride=1
pad=1
activation=leaky
non_zero_index=2,4,6,7,8,10,11,13,15,16,30,32,33,36,38,41,42,46,47,50,52,54,56,58,59,62,65,69,70,71,72,74,78,80,83,86,87,90,95,96,100,101,103,106,109,113,116,119,120,121,124,125,127,128,131,132,134,135,136,137,138,141,142,144,146,148,151,153,154,155,157,158,160,161,162,166,167,173,174,175,176,178,181,182,183,184,189,191,192,196,198,199,202,204,207,208,211,213,220,224,230,231,232,233,235,242,243,245,246,248,253,254,256,257,260,264,266,271,273,274,275,277,280,284,286,290,293,294,297,299,300,301,305,306,308,310,313,316,318,319,324,325,326,328,329,330,331,335,338,341,345,346,347,349,351,352,353,354,357,359,362,363,364,366,367,369,371,372,373,374,375,376,379,380,381,382,383,384,385,387,390,391,394,399,401,402,406,409,410,411,412,415,417,418,420,422,423,426,430,431,435,436,441,442,443,446,447,448,449,450,451,452,453,455,456,459,461,462,465,466,467,469,471,472,475,476,477,478,480,481,482,483,484,485,487,488,489,491,493,494,495,496,497,498,499,504,505,506,508,509,511
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=126
size=3
stride=2
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,549,47,49,582,70,79,594,601,94,97,99,101,615,107,108,621,114,626,116,629,630,119,124,639,130,134,650,655,144,145,664,672,676,680,171,686,687,691,192,714,207,210,211,724,218,224,229,742,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,292,804,807,810,815,816,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,421,423,425,943,437,954,964,453,455,456,967,968,461,974,976,468,983,476,989,991,481,995,998,1009
[convolutional]
batch_normalize=1
filters=38
size=1
stride=1
pad=1
activation=leaky
non_zero_index=233,256,338,398,399,445,450,464,465,467,469,470,474,475,476,477,478,481,482,483,484,486,488,491,492,493,494,497,498,499,501,502,503,504,506,507,508,509
[convolutional]
batch_normalize=1
filters=126
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,549,47,49,582,70,79,594,601,94,97,99,101,615,107,108,621,114,626,116,629,630,119,124,639,130,134,650,655,144,145,664,672,676,680,171,686,687,691,192,714,207,210,211,724,218,224,229,742,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,292,804,807,810,815,816,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,421,423,425,943,437,954,964,453,455,456,967,968,461,974,976,468,983,476,989,991,481,995,998,1009
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=41
size=1
stride=1
pad=1
activation=leaky
non_zero_index=31,56,109,119,146,152,158,163,171,181,190,202,222,329,350,359,383,449,451,459,477,479,480,483,488,489,491,492,493,496,497,498,500,501,502,504,505,507,508,509,510
[convolutional]
batch_normalize=1
filters=126
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,549,47,49,582,70,79,594,601,94,97,99,101,615,107,108,621,114,626,116,629,630,119,124,639,130,134,650,655,144,145,664,672,676,680,171,686,687,691,192,714,207,210,211,724,218,224,229,742,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,292,804,807,810,815,816,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,421,423,425,943,437,954,964,453,455,456,967,968,461,974,976,468,983,476,989,991,481,995,998,1009
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=45
size=1
stride=1
pad=1
activation=leaky
non_zero_index=22,42,172,214,242,251,300,313,379,385,449,450,453,470,472,473,474,475,476,477,479,480,482,483,484,485,487,488,489,490,491,492,493,494,496,497,498,499,500,503,504,505,506,507,509
[convolutional]
batch_normalize=1
filters=126
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,549,47,49,582,70,79,594,601,94,97,99,101,615,107,108,621,114,626,116,629,630,119,124,639,130,134,650,655,144,145,664,672,676,680,171,686,687,691,192,714,207,210,211,724,218,224,229,742,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,292,804,807,810,815,816,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,421,423,425,943,437,954,964,453,455,456,967,968,461,974,976,468,983,476,989,991,481,995,998,1009
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=31
size=1
stride=1
pad=1
activation=leaky
non_zero_index=364,449,462,463,464,465,466,467,468,469,470,471,479,480,486,487,489,490,491,493,494,495,496,498,500,504,505,506,507,508,511
[convolutional]
batch_normalize=1
filters=126
size=3
stride=1
pad=1
activation=leaky
non_zero_index=5,8,9,12,530,19,24,540,541,549,47,49,582,70,79,594,601,94,97,99,101,615,107,108,621,114,626,116,629,630,119,124,639,130,134,650,655,144,145,664,672,676,680,171,686,687,691,192,714,207,210,211,724,218,224,229,742,746,747,247,765,766,767,774,265,267,784,273,274,275,279,283,284,801,292,804,807,810,815,816,320,323,330,851,341,346,349,355,867,360,367,881,373,886,376,888,890,385,387,392,396,910,421,423,425,943,437,954,964,453,455,456,967,968,461,974,976,468,983,476,989,991,481,995,998,1009
[shortcut]
from=-3
activation=linear
[convolutional]
batch_normalize=1
filters=52
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,10,37,73,74,75,81,84,87,88,94,100,104,126,129,140,150,155,159,170,172,186,188,196,210,212,229,232,248,254,267,290,302,310,316,321,327,332,333,344,349,356,395,415,430,443,459,463,481,483,492,507
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=103
activation=leaky
non_zero_index=4,16,19,37,56,59,77,78,100,108,123,127,153,159,161,170,172,176,180,188,197,207,208,229,238,251,259,263,295,302,326,338,340,341,345,354,367,377,387,391,393,405,416,417,423,424,450,452,490,495,522,533,535,546,553,567,570,584,587,594,596,611,644,648,649,654,669,674,683,699,733,738,750,772,777,801,803,812,815,816,822,832,867,873,878,888,894,909,914,919,926,944,953,959,961,962,963,971,986,987,996,997,1010
[convolutional]
batch_normalize=1
filters=52
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,8,37,56,60,76,84,103,105,107,129,132,144,158,178,204,220,246,269,270,285,351,353,360,362,368,397,404,405,414,419,421,422,423,424,432,434,439,442,446,450,451,454,475,478,483,485,488,492,505,510,511
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=103
activation=leaky
non_zero_index=3,10,19,36,46,57,66,109,117,124,126,127,151,168,173,178,188,206,210,231,255,257,268,274,291,296,308,311,348,350,369,376,394,403,407,414,425,427,428,433,434,440,441,448,449,452,472,482,483,510,528,537,540,541,547,569,575,590,616,645,651,655,673,683,684,702,703,718,735,744,745,773,774,776,779,780,782,793,804,809,829,832,834,842,848,853,854,879,887,894,895,909,914,940,951,976,977,978,991,1006,1012,1018,1023
[convolutional]
batch_normalize=1
filters=52
size=1
stride=1
pad=1
activation=leaky
non_zero_index=9,49,68,86,96,115,116,119,136,137,139,142,149,151,160,173,196,210,218,226,231,240,242,262,267,268,274,286,287,298,303,304,321,327,331,359,373,375,379,380,384,387,391,396,402,417,423,451,455,476,497,509
[predict]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378,379,380,381,382,383,384,385,386,387,388,389,390,391,392,393,394,395,396,397,398,399,400,401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,420,421,422,423,424,425,426,427,428,429,430,431,432,433,434,435,436,437,438,439,440,441,442,443,444,445,446,447,448,449,450,451,452,453,454,455,456,457,458,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,479,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,501,502,503,504,505,506,507,508,509,510,511,512,513,514,515,516,517,518,519,520,521,522,523,524,525,526,527,528,529,530,531,532,533,534,535,536,537,538,539,540,541,542,543,544,545,546,547,548,549,550,551,552,553,554,555,556,557,558,559,560,561,562,563,564,565,566,567,568,569,570,571,572,573,574,575,576,577,578,579,580,581,582,583,584,585,586,587,588,589,590,591,592,593,594,595,596,597,598,599,600,601,602,603,604,605,606,607,608,609,610,611,612,613,614,615,616,617,618,619,620,621,622,623,624,625,626,627,628,629,630,631,632,633,634,635,636,637,638,639,640,641,642,643,644,645,646,647,648,649,650,651,652,653,654,655,656,657,658,659,660,661,662,663,664,665,666,667,668,669,670,671,672,673,674,675,676,677,678,679,680,681,682,683,684,685,686,687,688,689,690,691,692,693,694,695,696,697,698,699,700,701,702,703,704,705,706,707,708,709,710,711,712,713,714,715,716,717,718,719,720,721,722,723,724,725,726,727,728,729,730,731,732,733,734,735,736,737,738,739,740,741,742,743,744,745,746,747,748,749,750,751,752,753,754,755,756,757,758,759,760,761,762,763,764,765,766,767,768,769,770,771,772,773,774,775,776,777,778,779,780,781,782,783,784,785,786,787,788,789,790,791,792,793,794,795,796,797,798,799,800,801,802,803,804,805,806,807,808,809,810,811,812,813,814,815,816,817,818,819,820,821,822,823,824,825,826,827,828,829,830,831,832,833,834,835,836,837,838,839,840,841,842,843,844,845,846,847,848,849,850,851,852,853,854,855,856,857,858,859,860,861,862,863,864,865,866,867,868,869,870,871,872,873,874,875,876,877,878,879,880,881,882,883,884,885,886,887,888,889,890,891,892,893,894,895,896,897,898,899,900,901,902,903,904,905,906,907,908,909,910,911,912,913,914,915,916,917,918,919,920,921,922,923,924,925,926,927,928,929,930,931,932,933,934,935,936,937,938,939,940,941,942,943,944,945,946,947,948,949,950,951,952,953,954,955,956,957,958,959,960,961,962,963,964,965,966,967,968,969,970,971,972,973,974,975,976,977,978,979,980,981,982,983,984,985,986,987,988,989,990,991,992,993,994,995,996,997,998,999,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015,1016,1017,1018,1019,1020,1021,1022,1023
[predict]
batch_normalize=0
size=1
stride=1
pad=1
filters=75
activation=linear
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74
[yolo]
mask=6,7,8
anchors=10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=20
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
[route]
layers=-4
non_zero_index=9,49,68,86,96,115,116,119,136,137,139,142,149,151,160,173,196,210,218,226,231,240,242,262,267,268,274,286,287,298,303,304,321,327,331,359,373,375,379,380,384,387,391,396,402,417,423,451,455,476,497,509
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=3,5,30,31,33,46,56,73,90,101,105,118,121,122,143,146,149,166,167,173,180,184,194,229,239,252
[upsample]
stride=2
[route]
layers=-1, 61
non_zero_index=3,5,30,31,33,46,56,73,90,101,105,118,121,122,143,146,149,166,167,173,180,184,194,229,239,252,258,260,262,263,264,266,267,269,271,272,286,288,289,292,294,297,298,302,303,306,308,310,312,314,315,318,321,325,326,327,328,330,334,336,339,342,343,346,351,352,356,357,359,362,365,369,372,375,376,377,380,381,383,384,387,388,390,391,392,393,394,397,398,400,402,404,407,409,410,411,413,414,416,417,418,422,423,429,430,431,432,434,437,438,439,440,445,447,448,452,454,455,458,460,463,464,467,469,476,480,486,487,488,489,491,498,499,501,502,504,509,510,512,513,516,520,522,527,529,530,531,533,536,540,542,546,549,550,553,555,556,557,561,562,564,566,569,572,574,575,580,581,582,584,585,586,587,591,594,597,601,602,603,605,607,608,609,610,613,615,618,619,620,622,623,625,627,628,629,630,631,632,635,636,637,638,639,640,641,643,646,647,650,655,657,658,662,665,666,667,668,671,673,674,676,678,679,682,686,687,691,692,697,698,699,702,703,704,705,706,707,708,709,711,712,715,717,718,721,722,723,725,727,728,731,732,733,734,736,737,738,739,740,741,743,744,745,747,749,750,751,752,753,754,755,760,761,762,764,765,767
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=10,26,44,49,58,85,112,117,130,132,138,143,159,160,162,168,175,176,177,199,215,216,239,245,252,255
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=52
activation=leaky
non_zero_index=3,8,19,28,51,53,56,65,84,89,90,100,105,128,146,154,160,172,187,197,206,227,228,233,237,248,252,261,263,269,291,301,311,320,325,329,348,356,360,364,377,381,383,401,415,423,438,462,471,479,485,486
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=1,10,11,28,37,40,49,52,54,66,78,79,98,112,116,128,154,165,181,182,185,211,217,229,233,238
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=52
activation=leaky
non_zero_index=26,29,35,37,54,58,59,72,102,114,117,118,135,138,141,148,169,181,183,194,207,219,221,259,267,269,281,296,319,326,330,335,337,338,351,352,364,371,387,391,397,398,423,437,442,446,451,459,473,474,489,506
[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky
non_zero_index=9,12,16,18,24,35,41,60,69,101,104,128,129,136,148,151,155,160,189,193,207,227,229,246,249,252
[predict]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378,379,380,381,382,383,384,385,386,387,388,389,390,391,392,393,394,395,396,397,398,399,400,401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,420,421,422,423,424,425,426,427,428,429,430,431,432,433,434,435,436,437,438,439,440,441,442,443,444,445,446,447,448,449,450,451,452,453,454,455,456,457,458,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,479,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,501,502,503,504,505,506,507,508,509,510,511
[predict]
batch_normalize=0
size=1
stride=1
pad=1
filters=75
activation=linear
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74
[yolo]
mask=3,4,5
anchors=10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=20
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
[route]
layers=-4
non_zero_index=9,12,16,18,24,35,41,60,69,101,104,128,129,136,148,151,155,160,189,193,207,227,229,246,249,252
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=2,3,18,36,39,40,57,68,69,72,94,95,120
[upsample]
stride=2
[route]
layers=-1, 36
non_zero_index=2,3,18,36,39,40,57,68,69,72,94,95,120,131,132,133,134,135,136,138,139,140,141,142,144,145,146,147,152,153,154,157,158,159,161,163,164,165,169,171,172,173,174,179,181,182,183,184,185,187,188,190,193,196,198,199,200,202,203,204,205,207,208,209,211,214,216,217,218,219,224,225,227,228,231,232,233,234,236,237,239,241,242,243,245,246,248,249,250,251,252,253,255,256,258,259,260,261,265,266,267,269,270,271,272,275,279,280,281,285,287,288,289,290,292,300,301,302,304,305,306,308,310,312,313,314,315,319,320,321,323,324,327,328,329,330,331,334,335,337,338,339,340,342,344,345,346,348,351,353,355,360,365,366,367,368,374,377,378,381,383
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=8,17,23,36,38,39,50,54,55,61,65,76,93
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=26
activation=leaky
non_zero_index=5,6,12,22,36,49,56,73,81,88,104,107,115,120,144,148,149,150,157,175,178,189,191,233,237,254
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=0,1,10,29,34,56,60,65,66,69,78,82,118
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=26
activation=leaky
non_zero_index=17,21,23,46,48,70,77,117,122,125,126,132,139,160,168,177,187,205,206,212,215,219,238,244,254,255
[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
activation=leaky
non_zero_index=18,21,33,60,62,76,79,89,93,98,125,126,127
[predict]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255
[predict]
batch_normalize=0
size=1
stride=1
pad=1
filters=75
activation=linear
non_zero_index=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74
[yolo]
mask=0,1,2
anchors=10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=20
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
